Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usart.h
/* LIN mode */
#define US_CR_LIN_LINABT_Pos                20                                             /**< (US_CR) Abort LIN Transmission Position */
#define US_CR_LIN_LINABT_Msk                (_U_(0x1) << US_CR_LIN_LINABT_Pos)             /**< (US_CR) Abort LIN Transmission Mask */
#define US_CR_LIN_LINABT                    US_CR_LIN_LINABT_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_CR_LIN_LINABT_Msk instead */
#define US_CR_LIN_LINWKUP_Pos               21                                             /**< (US_CR) Send LIN Wakeup Signal Position */
#define US_CR_LIN_LINWKUP_Msk               (_U_(0x1) << US_CR_LIN_LINWKUP_Pos)            /**< (US_CR) Send LIN Wakeup Signal Mask */
#define US_CR_LIN_LINWKUP                   US_CR_LIN_LINWKUP_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_CR_LIN_LINWKUP_Msk instead */
#define US_CR_LIN_MASK                      _U_(0x300000)                                  /**< \deprecated (US_CR_LIN) Register MASK  (Use US_CR_LIN_Msk instead)  */
#define US_CR_LIN_Msk                       _U_(0x300000)                                  /**< (US_CR_LIN) Register Mask  */


/* -------- US_MR : (USART Offset: 0x04) (R/W 32) Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t USART_MODE:4;              /**< bit:   0..3  USART Mode of Operation                  */
    uint32_t USCLKS:2;                  /**< bit:   4..5  Clock Selection                          */
    uint32_t CHRL:2;                    /**< bit:   6..7  Character Length                         */
    uint32_t :10;                       /**< bit:  8..17  Reserved */
    uint32_t CLKO:1;                    /**< bit:     18  Clock Output Select                      */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct { // USART mode
    uint32_t :8;                        /**< bit:   0..7  Reserved */
    uint32_t SYNC:1;                    /**< bit:      8  Synchronous Mode Select                  */
    uint32_t PAR:3;                     /**< bit:  9..11  Parity Type                              */
    uint32_t NBSTOP:2;                  /**< bit: 12..13  Number of Stop Bits                      */
    uint32_t CHMODE:2;                  /**< bit: 14..15  Channel Mode                             */
    uint32_t MSBF:1;                    /**< bit:     16  Bit Order                                */
    uint32_t MODE9:1;                   /**< bit:     17  9-bit Character Length                   */
    uint32_t :1;                        /**< bit:     18  Reserved */
    uint32_t OVER:1;                    /**< bit:     19  Oversampling Mode                        */
    uint32_t INACK:1;                   /**< bit:     20  Inhibit Non Acknowledge                  */
    uint32_t DSNACK:1;                  /**< bit:     21  Disable Successive NACK                  */
    uint32_t VAR_SYNC:1;                /**< bit:     22  Variable Synchronization of Command/Data Sync Start Frame Delimiter */
    uint32_t INVDATA:1;                 /**< bit:     23  Inverted Data                            */
    uint32_t MAX_ITERATION:3;           /**< bit: 24..26  Maximum Number of Automatic Iteration    */
    uint32_t :1;                        /**< bit:     27  Reserved */
    uint32_t FILTER:1;                  /**< bit:     28  Receive Line Filter                      */
    uint32_t MAN:1;                     /**< bit:     29  Manchester Encoder/Decoder Enable        */
    uint32_t MODSYNC:1;                 /**< bit:     30  Manchester Synchronization Mode          */
    uint32_t ONEBIT:1;                  /**< bit:     31  Start Frame Delimiter Selector           */
  } USART;                                /**< Structure used for USART mode access */
  struct { // SPI mode
    uint32_t :8;                        /**< bit:   0..7  Reserved */
    uint32_t CPHA:1;                    /**< bit:      8  SPI Clock Phase                          */
    uint32_t :7;                        /**< bit:  9..15  Reserved */
    uint32_t CPOL:1;                    /**< bit:     16  SPI Clock Polarity                       */
    uint32_t :3;                        /**< bit: 17..19  Reserved */
    uint32_t WRDBT:1;                   /**< bit:     20  Wait Read Data Before Transfer           */
    uint32_t :11;                       /**< bit: 21..31  Reserved */
  } SPI;                                /**< Structure used for SPI mode access */
  uint32_t reg;                         /**< Type used for register access */
} US_MR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_MR_OFFSET                        (0x04)                                        /**<  (US_MR) Mode Register  Offset */

#define US_MR_USART_MODE_Pos                0                                              /**< (US_MR) USART Mode of Operation Position */
#define US_MR_USART_MODE_Msk                (_U_(0xF) << US_MR_USART_MODE_Pos)             /**< (US_MR) USART Mode of Operation Mask */
#define US_MR_USART_MODE(value)             (US_MR_USART_MODE_Msk & ((value) << US_MR_USART_MODE_Pos))
#define   US_MR_USART_MODE_NORMAL_Val       _U_(0x0)                                       /**< (US_MR) Normal mode  */
#define   US_MR_USART_MODE_RS485_Val        _U_(0x1)                                       /**< (US_MR) RS485  */
#define   US_MR_USART_MODE_HW_HANDSHAKING_Val _U_(0x2)                                       /**< (US_MR) Hardware handshaking  */
#define   US_MR_USART_MODE_MODEM_Val        _U_(0x3)                                       /**< (US_MR) Modem  */
#define   US_MR_USART_MODE_IS07816_T_0_Val  _U_(0x4)                                       /**< (US_MR) IS07816 Protocol: T = 0  */
#define   US_MR_USART_MODE_IS07816_T_1_Val  _U_(0x6)                                       /**< (US_MR) IS07816 Protocol: T = 1  */
#define   US_MR_USART_MODE_IRDA_Val         _U_(0x8)                                       /**< (US_MR) IrDA  */
#define   US_MR_USART_MODE_LON_Val          _U_(0x9)                                       /**< (US_MR) LON  */
#define   US_MR_USART_MODE_LIN_MASTER_Val   _U_(0xA)                                       /**< (US_MR) LIN Master mode  */
#define   US_MR_USART_MODE_LIN_SLAVE_Val    _U_(0xB)                                       /**< (US_MR) LIN Slave mode  */
#define   US_MR_USART_MODE_SPI_MASTER_Val   _U_(0xE)                                       /**< (US_MR) SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2)  */
#define   US_MR_USART_MODE_SPI_SLAVE_Val    _U_(0xF)                                       /**< (US_MR) SPI Slave mode  */
#define US_MR_USART_MODE_NORMAL             (US_MR_USART_MODE_NORMAL_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) Normal mode Position  */
#define US_MR_USART_MODE_RS485              (US_MR_USART_MODE_RS485_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) RS485 Position  */
#define US_MR_USART_MODE_HW_HANDSHAKING     (US_MR_USART_MODE_HW_HANDSHAKING_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) Hardware handshaking Position  */
#define US_MR_USART_MODE_MODEM              (US_MR_USART_MODE_MODEM_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) Modem Position  */
#define US_MR_USART_MODE_IS07816_T_0        (US_MR_USART_MODE_IS07816_T_0_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) IS07816 Protocol: T = 0 Position  */
#define US_MR_USART_MODE_IS07816_T_1        (US_MR_USART_MODE_IS07816_T_1_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) IS07816 Protocol: T = 1 Position  */
#define US_MR_USART_MODE_IRDA               (US_MR_USART_MODE_IRDA_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) IrDA Position  */
#define US_MR_USART_MODE_LON                (US_MR_USART_MODE_LON_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) LON Position  */
#define US_MR_USART_MODE_LIN_MASTER         (US_MR_USART_MODE_LIN_MASTER_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) LIN Master mode Position  */
#define US_MR_USART_MODE_LIN_SLAVE          (US_MR_USART_MODE_LIN_SLAVE_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) LIN Slave mode Position  */
#define US_MR_USART_MODE_SPI_MASTER         (US_MR_USART_MODE_SPI_MASTER_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2) Position  */
#define US_MR_USART_MODE_SPI_SLAVE          (US_MR_USART_MODE_SPI_SLAVE_Val << US_MR_USART_MODE_Pos)  /**< (US_MR) SPI Slave mode Position  */
#define US_MR_USCLKS_Pos                    4                                              /**< (US_MR) Clock Selection Position */
#define US_MR_USCLKS_Msk                    (_U_(0x3) << US_MR_USCLKS_Pos)                 /**< (US_MR) Clock Selection Mask */
#define US_MR_USCLKS(value)                 (US_MR_USCLKS_Msk & ((value) << US_MR_USCLKS_Pos))
#define   US_MR_USCLKS_MCK_Val              _U_(0x0)                                       /**< (US_MR) Peripheral clock is selected  */
#define   US_MR_USCLKS_DIV_Val              _U_(0x1)                                       /**< (US_MR) Peripheral clock divided (DIV = 8) is selected  */
#define   US_MR_USCLKS_PCK_Val              _U_(0x2)                                       /**< (US_MR) PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1.  */
#define   US_MR_USCLKS_SCK_Val              _U_(0x3)                                       /**< (US_MR) Serial clock (SCK) is selected  */
#define US_MR_USCLKS_MCK                    (US_MR_USCLKS_MCK_Val << US_MR_USCLKS_Pos)     /**< (US_MR) Peripheral clock is selected Position  */
#define US_MR_USCLKS_DIV                    (US_MR_USCLKS_DIV_Val << US_MR_USCLKS_Pos)     /**< (US_MR) Peripheral clock divided (DIV = 8) is selected Position  */
#define US_MR_USCLKS_PCK                    (US_MR_USCLKS_PCK_Val << US_MR_USCLKS_Pos)     /**< (US_MR) PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1. Position  */
#define US_MR_USCLKS_SCK                    (US_MR_USCLKS_SCK_Val << US_MR_USCLKS_Pos)     /**< (US_MR) Serial clock (SCK) is selected Position  */
#define US_MR_CHRL_Pos                      6                                              /**< (US_MR) Character Length Position */
#define US_MR_CHRL_Msk                      (_U_(0x3) << US_MR_CHRL_Pos)                   /**< (US_MR) Character Length Mask */
#define US_MR_CHRL(value)                   (US_MR_CHRL_Msk & ((value) << US_MR_CHRL_Pos))
#define   US_MR_CHRL_5_BIT_Val              _U_(0x0)                                       /**< (US_MR) Character length is 5 bits  */
#define   US_MR_CHRL_6_BIT_Val              _U_(0x1)                                       /**< (US_MR) Character length is 6 bits  */
#define   US_MR_CHRL_7_BIT_Val              _U_(0x2)                                       /**< (US_MR) Character length is 7 bits  */
#define   US_MR_CHRL_8_BIT_Val              _U_(0x3)                                       /**< (US_MR) Character length is 8 bits  */
#define US_MR_CHRL_5_BIT                    (US_MR_CHRL_5_BIT_Val << US_MR_CHRL_Pos)       /**< (US_MR) Character length is 5 bits Position  */
#define US_MR_CHRL_6_BIT                    (US_MR_CHRL_6_BIT_Val << US_MR_CHRL_Pos)       /**< (US_MR) Character length is 6 bits Position  */
#define US_MR_CHRL_7_BIT                    (US_MR_CHRL_7_BIT_Val << US_MR_CHRL_Pos)       /**< (US_MR) Character length is 7 bits Position  */
#define US_MR_CHRL_8_BIT                    (US_MR_CHRL_8_BIT_Val << US_MR_CHRL_Pos)       /**< (US_MR) Character length is 8 bits Position  */
#define US_MR_CLKO_Pos                      18                                             /**< (US_MR) Clock Output Select Position */
#define US_MR_CLKO_Msk                      (_U_(0x1) << US_MR_CLKO_Pos)                   /**< (US_MR) Clock Output Select Mask */
#define US_MR_CLKO                          US_MR_CLKO_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_CLKO_Msk instead */
#define US_MR_MASK                          _U_(0x400FF)                                   /**< \deprecated (US_MR) Register MASK  (Use US_MR_Msk instead)  */
#define US_MR_Msk                           _U_(0x400FF)                                   /**< (US_MR) Register Mask  */

/* USART mode */
#define US_MR_USART_SYNC_Pos                8                                              /**< (US_MR) Synchronous Mode Select Position */
#define US_MR_USART_SYNC_Msk                (_U_(0x1) << US_MR_USART_SYNC_Pos)             /**< (US_MR) Synchronous Mode Select Mask */
#define US_MR_USART_SYNC                    US_MR_USART_SYNC_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_SYNC_Msk instead */
#define US_MR_USART_PAR_Pos                 9                                              /**< (US_MR) Parity Type Position */
#define US_MR_USART_PAR_Msk                 (_U_(0x7) << US_MR_USART_PAR_Pos)              /**< (US_MR) Parity Type Mask */
#define US_MR_USART_PAR(value)              (US_MR_USART_PAR_Msk & ((value) << US_MR_USART_PAR_Pos))
#define   US_MR_USART_PAR_EVEN_Val          _U_(0x0)                                       /**< (US_MR) USART Even parity  */
#define   US_MR_USART_PAR_ODD_Val           _U_(0x1)                                       /**< (US_MR) USART Odd parity  */
#define   US_MR_USART_PAR_SPACE_Val         _U_(0x2)                                       /**< (US_MR) USART Parity forced to 0 (Space)  */
#define   US_MR_USART_PAR_MARK_Val          _U_(0x3)                                       /**< (US_MR) USART Parity forced to 1 (Mark)  */
#define   US_MR_USART_PAR_NO_Val            _U_(0x4)                                       /**< (US_MR) USART No parity  */
#define   US_MR_USART_PAR_MULTIDROP_Val     _U_(0x6)                                       /**< (US_MR) USART Multidrop mode  */
#define US_MR_USART_PAR_EVEN                (US_MR_USART_PAR_EVEN_Val << US_MR_USART_PAR_Pos)  /**< (US_MR) Even parity Position  */
#define US_MR_USART_PAR_ODD                 (US_MR_USART_PAR_ODD_Val << US_MR_USART_PAR_Pos)  /**< (US_MR) Odd parity Position  */
#define US_MR_USART_PAR_SPACE               (US_MR_USART_PAR_SPACE_Val << US_MR_USART_PAR_Pos)  /**< (US_MR) Parity forced to 0 (Space) Position  */
#define US_MR_USART_PAR_MARK                (US_MR_USART_PAR_MARK_Val << US_MR_USART_PAR_Pos)  /**< (US_MR) Parity forced to 1 (Mark) Position  */
#define US_MR_USART_PAR_NO                  (US_MR_USART_PAR_NO_Val << US_MR_USART_PAR_Pos)  /**< (US_MR) No parity Position  */
#define US_MR_USART_PAR_MULTIDROP           (US_MR_USART_PAR_MULTIDROP_Val << US_MR_USART_PAR_Pos)  /**< (US_MR) Multidrop mode Position  */
#define US_MR_USART_NBSTOP_Pos              12                                             /**< (US_MR) Number of Stop Bits Position */
#define US_MR_USART_NBSTOP_Msk              (_U_(0x3) << US_MR_USART_NBSTOP_Pos)           /**< (US_MR) Number of Stop Bits Mask */
#define US_MR_USART_NBSTOP(value)           (US_MR_USART_NBSTOP_Msk & ((value) << US_MR_USART_NBSTOP_Pos))
#define   US_MR_USART_NBSTOP_1_BIT_Val      _U_(0x0)                                       /**< (US_MR) USART 1 stop bit  */
#define   US_MR_USART_NBSTOP_1_5_BIT_Val    _U_(0x1)                                       /**< (US_MR) USART 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)  */
#define   US_MR_USART_NBSTOP_2_BIT_Val      _U_(0x2)                                       /**< (US_MR) USART 2 stop bits  */
#define US_MR_USART_NBSTOP_1_BIT            (US_MR_USART_NBSTOP_1_BIT_Val << US_MR_USART_NBSTOP_Pos)  /**< (US_MR) 1 stop bit Position  */
#define US_MR_USART_NBSTOP_1_5_BIT          (US_MR_USART_NBSTOP_1_5_BIT_Val << US_MR_USART_NBSTOP_Pos)  /**< (US_MR) 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1) Position  */
#define US_MR_USART_NBSTOP_2_BIT            (US_MR_USART_NBSTOP_2_BIT_Val << US_MR_USART_NBSTOP_Pos)  /**< (US_MR) 2 stop bits Position  */
#define US_MR_USART_CHMODE_Pos              14                                             /**< (US_MR) Channel Mode Position */
#define US_MR_USART_CHMODE_Msk              (_U_(0x3) << US_MR_USART_CHMODE_Pos)           /**< (US_MR) Channel Mode Mask */
#define US_MR_USART_CHMODE(value)           (US_MR_USART_CHMODE_Msk & ((value) << US_MR_USART_CHMODE_Pos))
#define   US_MR_USART_CHMODE_NORMAL_Val     _U_(0x0)                                       /**< (US_MR) USART Normal mode  */
#define   US_MR_USART_CHMODE_AUTOMATIC_Val  _U_(0x1)                                       /**< (US_MR) USART Automatic Echo. Receiver input is connected to the TXD pin.  */
#define   US_MR_USART_CHMODE_LOCAL_LOOPBACK_Val _U_(0x2)                                       /**< (US_MR) USART Local Loopback. Transmitter output is connected to the Receiver Input.  */
#define   US_MR_USART_CHMODE_REMOTE_LOOPBACK_Val _U_(0x3)                                       /**< (US_MR) USART Remote Loopback. RXD pin is internally connected to the TXD pin.  */
#define US_MR_USART_CHMODE_NORMAL           (US_MR_USART_CHMODE_NORMAL_Val << US_MR_USART_CHMODE_Pos)  /**< (US_MR) Normal mode Position  */
#define US_MR_USART_CHMODE_AUTOMATIC        (US_MR_USART_CHMODE_AUTOMATIC_Val << US_MR_USART_CHMODE_Pos)  /**< (US_MR) Automatic Echo. Receiver input is connected to the TXD pin. Position  */
#define US_MR_USART_CHMODE_LOCAL_LOOPBACK   (US_MR_USART_CHMODE_LOCAL_LOOPBACK_Val << US_MR_USART_CHMODE_Pos)  /**< (US_MR) Local Loopback. Transmitter output is connected to the Receiver Input. Position  */
#define US_MR_USART_CHMODE_REMOTE_LOOPBACK  (US_MR_USART_CHMODE_REMOTE_LOOPBACK_Val << US_MR_USART_CHMODE_Pos)  /**< (US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin. Position  */
#define US_MR_USART_MSBF_Pos                16                                             /**< (US_MR) Bit Order Position */
#define US_MR_USART_MSBF_Msk                (_U_(0x1) << US_MR_USART_MSBF_Pos)             /**< (US_MR) Bit Order Mask */
#define US_MR_USART_MSBF                    US_MR_USART_MSBF_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_MSBF_Msk instead */
#define US_MR_USART_MODE9_Pos               17                                             /**< (US_MR) 9-bit Character Length Position */
#define US_MR_USART_MODE9_Msk               (_U_(0x1) << US_MR_USART_MODE9_Pos)            /**< (US_MR) 9-bit Character Length Mask */
#define US_MR_USART_MODE9                   US_MR_USART_MODE9_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_MODE9_Msk instead */
#define US_MR_USART_OVER_Pos                19                                             /**< (US_MR) Oversampling Mode Position */
#define US_MR_USART_OVER_Msk                (_U_(0x1) << US_MR_USART_OVER_Pos)             /**< (US_MR) Oversampling Mode Mask */
#define US_MR_USART_OVER                    US_MR_USART_OVER_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_OVER_Msk instead */
#define US_MR_USART_INACK_Pos               20                                             /**< (US_MR) Inhibit Non Acknowledge Position */
#define US_MR_USART_INACK_Msk               (_U_(0x1) << US_MR_USART_INACK_Pos)            /**< (US_MR) Inhibit Non Acknowledge Mask */
#define US_MR_USART_INACK                   US_MR_USART_INACK_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_INACK_Msk instead */
#define US_MR_USART_DSNACK_Pos              21                                             /**< (US_MR) Disable Successive NACK Position */
#define US_MR_USART_DSNACK_Msk              (_U_(0x1) << US_MR_USART_DSNACK_Pos)           /**< (US_MR) Disable Successive NACK Mask */
#define US_MR_USART_DSNACK                  US_MR_USART_DSNACK_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_DSNACK_Msk instead */
#define US_MR_USART_VAR_SYNC_Pos            22                                             /**< (US_MR) Variable Synchronization of Command/Data Sync Start Frame Delimiter Position */
#define US_MR_USART_VAR_SYNC_Msk            (_U_(0x1) << US_MR_USART_VAR_SYNC_Pos)         /**< (US_MR) Variable Synchronization of Command/Data Sync Start Frame Delimiter Mask */
#define US_MR_USART_VAR_SYNC                US_MR_USART_VAR_SYNC_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_VAR_SYNC_Msk instead */
#define US_MR_USART_INVDATA_Pos             23                                             /**< (US_MR) Inverted Data Position */
#define US_MR_USART_INVDATA_Msk             (_U_(0x1) << US_MR_USART_INVDATA_Pos)          /**< (US_MR) Inverted Data Mask */
#define US_MR_USART_INVDATA                 US_MR_USART_INVDATA_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_INVDATA_Msk instead */
#define US_MR_USART_MAX_ITERATION_Pos       24                                             /**< (US_MR) Maximum Number of Automatic Iteration Position */
#define US_MR_USART_MAX_ITERATION_Msk       (_U_(0x7) << US_MR_USART_MAX_ITERATION_Pos)    /**< (US_MR) Maximum Number of Automatic Iteration Mask */
#define US_MR_USART_MAX_ITERATION(value)    (US_MR_USART_MAX_ITERATION_Msk & ((value) << US_MR_USART_MAX_ITERATION_Pos))
#define US_MR_USART_FILTER_Pos              28                                             /**< (US_MR) Receive Line Filter Position */
#define US_MR_USART_FILTER_Msk              (_U_(0x1) << US_MR_USART_FILTER_Pos)           /**< (US_MR) Receive Line Filter Mask */
#define US_MR_USART_FILTER                  US_MR_USART_FILTER_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_FILTER_Msk instead */
#define US_MR_USART_MAN_Pos                 29                                             /**< (US_MR) Manchester Encoder/Decoder Enable Position */
#define US_MR_USART_MAN_Msk                 (_U_(0x1) << US_MR_USART_MAN_Pos)              /**< (US_MR) Manchester Encoder/Decoder Enable Mask */
#define US_MR_USART_MAN                     US_MR_USART_MAN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_MAN_Msk instead */
#define US_MR_USART_MODSYNC_Pos             30                                             /**< (US_MR) Manchester Synchronization Mode Position */
#define US_MR_USART_MODSYNC_Msk             (_U_(0x1) << US_MR_USART_MODSYNC_Pos)          /**< (US_MR) Manchester Synchronization Mode Mask */
#define US_MR_USART_MODSYNC                 US_MR_USART_MODSYNC_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_MODSYNC_Msk instead */
#define US_MR_USART_ONEBIT_Pos              31                                             /**< (US_MR) Start Frame Delimiter Selector Position */
#define US_MR_USART_ONEBIT_Msk              (_U_(0x1) << US_MR_USART_ONEBIT_Pos)           /**< (US_MR) Start Frame Delimiter Selector Mask */
#define US_MR_USART_ONEBIT                  US_MR_USART_ONEBIT_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_USART_ONEBIT_Msk instead */
#define US_MR_USART_MASK                    _U_(0xF7FBFF00)                                /**< \deprecated (US_MR_USART) Register MASK  (Use US_MR_USART_Msk instead)  */
#define US_MR_USART_Msk                     _U_(0xF7FBFF00)                                /**< (US_MR_USART) Register Mask  */

