Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usart.h
/* SPI mode */
#define US_MR_SPI_CPHA_Pos                  8                                              /**< (US_MR) SPI Clock Phase Position */
#define US_MR_SPI_CPHA_Msk                  (_U_(0x1) << US_MR_SPI_CPHA_Pos)               /**< (US_MR) SPI Clock Phase Mask */
#define US_MR_SPI_CPHA                      US_MR_SPI_CPHA_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_SPI_CPHA_Msk instead */
#define US_MR_SPI_CPOL_Pos                  16                                             /**< (US_MR) SPI Clock Polarity Position */
#define US_MR_SPI_CPOL_Msk                  (_U_(0x1) << US_MR_SPI_CPOL_Pos)               /**< (US_MR) SPI Clock Polarity Mask */
#define US_MR_SPI_CPOL                      US_MR_SPI_CPOL_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_SPI_CPOL_Msk instead */
#define US_MR_SPI_WRDBT_Pos                 20                                             /**< (US_MR) Wait Read Data Before Transfer Position */
#define US_MR_SPI_WRDBT_Msk                 (_U_(0x1) << US_MR_SPI_WRDBT_Pos)              /**< (US_MR) Wait Read Data Before Transfer Mask */
#define US_MR_SPI_WRDBT                     US_MR_SPI_WRDBT_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_MR_SPI_WRDBT_Msk instead */
#define US_MR_SPI_MASK                      _U_(0x110100)                                  /**< \deprecated (US_MR_SPI) Register MASK  (Use US_MR_SPI_Msk instead)  */
#define US_MR_SPI_Msk                       _U_(0x110100)                                  /**< (US_MR_SPI) Register Mask  */


/* -------- US_IER : (USART Offset: 0x08) (/W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t RXRDY:1;                   /**< bit:      0  RXRDY Interrupt Enable                   */
    uint32_t TXRDY:1;                   /**< bit:      1  TXRDY Interrupt Enable                   */
    uint32_t :3;                        /**< bit:   2..4  Reserved */
    uint32_t OVRE:1;                    /**< bit:      5  Overrun Error Interrupt Enable           */
    uint32_t :3;                        /**< bit:   6..8  Reserved */
    uint32_t TXEMPTY:1;                 /**< bit:      9  TXEMPTY Interrupt Enable                 */
    uint32_t :22;                       /**< bit: 10..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct { // USART mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXBRK:1;                   /**< bit:      2  Receiver Break Interrupt Enable          */
    uint32_t :7;                        /**< bit:   3..9  Reserved */
    uint32_t ITER:1;                    /**< bit:     10  Max number of Repetitions Reached Interrupt Enable */
    uint32_t :2;                        /**< bit: 11..12  Reserved */
    uint32_t NACK:1;                    /**< bit:     13  Non Acknowledge Interrupt Enable         */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t RIIC:1;                    /**< bit:     16  Ring Indicator Input Change Enable       */
    uint32_t DSRIC:1;                   /**< bit:     17  Data Set Ready Input Change Enable       */
    uint32_t DCDIC:1;                   /**< bit:     18  Data Carrier Detect Input Change Interrupt Enable */
    uint32_t CTSIC:1;                   /**< bit:     19  Clear to Send Input Change Interrupt Enable */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t MANE:1;                    /**< bit:     24  Manchester Error Interrupt Enable        */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } USART;                                /**< Structure used for USART mode access */
  struct { // USART_LIN mode
    uint32_t :6;                        /**< bit:   0..5  Reserved */
    uint32_t FRAME:1;                   /**< bit:      6  Framing Error Interrupt Enable           */
    uint32_t PARE:1;                    /**< bit:      7  Parity Error Interrupt Enable            */
    uint32_t TIMEOUT:1;                 /**< bit:      8  Timeout Interrupt Enable                 */
    uint32_t :23;                       /**< bit:  9..31  Reserved */
  } USART_LIN;                                /**< Structure used for USART_LIN mode access */
  struct { // SPI mode
    uint32_t :19;                       /**< bit:  0..18  Reserved */
    uint32_t NSSE:1;                    /**< bit:     19  NSS Line (Driving CTS Pin) Rising or Falling Edge Event */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } SPI;                                /**< Structure used for SPI mode access */
  struct { // LIN mode
    uint32_t :13;                       /**< bit:  0..12  Reserved */
    uint32_t LINBK:1;                   /**< bit:     13  LIN Break Sent or LIN Break Received Interrupt Enable */
    uint32_t LINID:1;                   /**< bit:     14  LIN Identifier Sent or LIN Identifier Received Interrupt Enable */
    uint32_t LINTC:1;                   /**< bit:     15  LIN Transfer Completed Interrupt Enable  */
    uint32_t :9;                        /**< bit: 16..24  Reserved */
    uint32_t LINBE:1;                   /**< bit:     25  LIN Bus Error Interrupt Enable           */
    uint32_t LINISFE:1;                 /**< bit:     26  LIN Inconsistent Synch Field Error Interrupt Enable */
    uint32_t LINIPE:1;                  /**< bit:     27  LIN Identifier Parity Interrupt Enable   */
    uint32_t LINCE:1;                   /**< bit:     28  LIN Checksum Error Interrupt Enable      */
    uint32_t LINSNRE:1;                 /**< bit:     29  LIN Slave Not Responding Error Interrupt Enable */
    uint32_t LINSTE:1;                  /**< bit:     30  LIN Synch Tolerance Error Interrupt Enable */
    uint32_t LINHTE:1;                  /**< bit:     31  LIN Header Timeout Error Interrupt Enable */
  } LIN;                                /**< Structure used for LIN mode access */
  struct { // LON mode
    uint32_t :6;                        /**< bit:   0..5  Reserved */
    uint32_t LSFE:1;                    /**< bit:      6  LON Short Frame Error Interrupt Enable   */
    uint32_t LCRCE:1;                   /**< bit:      7  LON CRC Error Interrupt Enable           */
    uint32_t :16;                       /**< bit:  8..23  Reserved */
    uint32_t LTXD:1;                    /**< bit:     24  LON Transmission Done Interrupt Enable   */
    uint32_t LCOL:1;                    /**< bit:     25  LON Collision Interrupt Enable           */
    uint32_t LFET:1;                    /**< bit:     26  LON Frame Early Termination Interrupt Enable */
    uint32_t LRXD:1;                    /**< bit:     27  LON Reception Done Interrupt Enable      */
    uint32_t LBLOVFE:1;                 /**< bit:     28  LON Backlog Overflow Error Interrupt Enable */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } LON;                                /**< Structure used for LON mode access */
  struct { // LON_SPI mode
    uint32_t :10;                       /**< bit:   0..9  Reserved */
    uint32_t UNRE:1;                    /**< bit:     10  Underrun Error Interrupt Enable          */
    uint32_t :21;                       /**< bit: 11..31  Reserved */
  } LON_SPI;                                /**< Structure used for LON_SPI mode access */
  uint32_t reg;                         /**< Type used for register access */
} US_IER_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_IER_OFFSET                       (0x08)                                        /**<  (US_IER) Interrupt Enable Register  Offset */

