Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usart.h
/* LIN mode */
#define US_IER_LIN_LINBK_Pos                13                                             /**< (US_IER) LIN Break Sent or LIN Break Received Interrupt Enable Position */
#define US_IER_LIN_LINBK_Msk                (_U_(0x1) << US_IER_LIN_LINBK_Pos)             /**< (US_IER) LIN Break Sent or LIN Break Received Interrupt Enable Mask */
#define US_IER_LIN_LINBK                    US_IER_LIN_LINBK_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LIN_LINBK_Msk instead */
#define US_IER_LIN_LINID_Pos                14                                             /**< (US_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable Position */
#define US_IER_LIN_LINID_Msk                (_U_(0x1) << US_IER_LIN_LINID_Pos)             /**< (US_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable Mask */
#define US_IER_LIN_LINID                    US_IER_LIN_LINID_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LIN_LINID_Msk instead */
#define US_IER_LIN_LINTC_Pos                15                                             /**< (US_IER) LIN Transfer Completed Interrupt Enable Position */
#define US_IER_LIN_LINTC_Msk                (_U_(0x1) << US_IER_LIN_LINTC_Pos)             /**< (US_IER) LIN Transfer Completed Interrupt Enable Mask */
#define US_IER_LIN_LINTC                    US_IER_LIN_LINTC_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LIN_LINTC_Msk instead */
#define US_IER_LIN_LINBE_Pos                25                                             /**< (US_IER) LIN Bus Error Interrupt Enable Position */
#define US_IER_LIN_LINBE_Msk                (_U_(0x1) << US_IER_LIN_LINBE_Pos)             /**< (US_IER) LIN Bus Error Interrupt Enable Mask */
#define US_IER_LIN_LINBE                    US_IER_LIN_LINBE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LIN_LINBE_Msk instead */
#define US_IER_LIN_LINISFE_Pos              26                                             /**< (US_IER) LIN Inconsistent Synch Field Error Interrupt Enable Position */
#define US_IER_LIN_LINISFE_Msk              (_U_(0x1) << US_IER_LIN_LINISFE_Pos)           /**< (US_IER) LIN Inconsistent Synch Field Error Interrupt Enable Mask */
#define US_IER_LIN_LINISFE                  US_IER_LIN_LINISFE_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LIN_LINISFE_Msk instead */
#define US_IER_LIN_LINIPE_Pos               27                                             /**< (US_IER) LIN Identifier Parity Interrupt Enable Position */
#define US_IER_LIN_LINIPE_Msk               (_U_(0x1) << US_IER_LIN_LINIPE_Pos)            /**< (US_IER) LIN Identifier Parity Interrupt Enable Mask */
#define US_IER_LIN_LINIPE                   US_IER_LIN_LINIPE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LIN_LINIPE_Msk instead */
#define US_IER_LIN_LINCE_Pos                28                                             /**< (US_IER) LIN Checksum Error Interrupt Enable Position */
#define US_IER_LIN_LINCE_Msk                (_U_(0x1) << US_IER_LIN_LINCE_Pos)             /**< (US_IER) LIN Checksum Error Interrupt Enable Mask */
#define US_IER_LIN_LINCE                    US_IER_LIN_LINCE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LIN_LINCE_Msk instead */
#define US_IER_LIN_LINSNRE_Pos              29                                             /**< (US_IER) LIN Slave Not Responding Error Interrupt Enable Position */
#define US_IER_LIN_LINSNRE_Msk              (_U_(0x1) << US_IER_LIN_LINSNRE_Pos)           /**< (US_IER) LIN Slave Not Responding Error Interrupt Enable Mask */
#define US_IER_LIN_LINSNRE                  US_IER_LIN_LINSNRE_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LIN_LINSNRE_Msk instead */
#define US_IER_LIN_LINSTE_Pos               30                                             /**< (US_IER) LIN Synch Tolerance Error Interrupt Enable Position */
#define US_IER_LIN_LINSTE_Msk               (_U_(0x1) << US_IER_LIN_LINSTE_Pos)            /**< (US_IER) LIN Synch Tolerance Error Interrupt Enable Mask */
#define US_IER_LIN_LINSTE                   US_IER_LIN_LINSTE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LIN_LINSTE_Msk instead */
#define US_IER_LIN_LINHTE_Pos               31                                             /**< (US_IER) LIN Header Timeout Error Interrupt Enable Position */
#define US_IER_LIN_LINHTE_Msk               (_U_(0x1) << US_IER_LIN_LINHTE_Pos)            /**< (US_IER) LIN Header Timeout Error Interrupt Enable Mask */
#define US_IER_LIN_LINHTE                   US_IER_LIN_LINHTE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LIN_LINHTE_Msk instead */
#define US_IER_LIN_MASK                     _U_(0xFE00E000)                                /**< \deprecated (US_IER_LIN) Register MASK  (Use US_IER_LIN_Msk instead)  */
#define US_IER_LIN_Msk                      _U_(0xFE00E000)                                /**< (US_IER_LIN) Register Mask  */

/* LON mode */
#define US_IER_LON_LSFE_Pos                 6                                              /**< (US_IER) LON Short Frame Error Interrupt Enable Position */
#define US_IER_LON_LSFE_Msk                 (_U_(0x1) << US_IER_LON_LSFE_Pos)              /**< (US_IER) LON Short Frame Error Interrupt Enable Mask */
#define US_IER_LON_LSFE                     US_IER_LON_LSFE_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LON_LSFE_Msk instead */
#define US_IER_LON_LCRCE_Pos                7                                              /**< (US_IER) LON CRC Error Interrupt Enable Position */
#define US_IER_LON_LCRCE_Msk                (_U_(0x1) << US_IER_LON_LCRCE_Pos)             /**< (US_IER) LON CRC Error Interrupt Enable Mask */
#define US_IER_LON_LCRCE                    US_IER_LON_LCRCE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LON_LCRCE_Msk instead */
#define US_IER_LON_LTXD_Pos                 24                                             /**< (US_IER) LON Transmission Done Interrupt Enable Position */
#define US_IER_LON_LTXD_Msk                 (_U_(0x1) << US_IER_LON_LTXD_Pos)              /**< (US_IER) LON Transmission Done Interrupt Enable Mask */
#define US_IER_LON_LTXD                     US_IER_LON_LTXD_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LON_LTXD_Msk instead */
#define US_IER_LON_LCOL_Pos                 25                                             /**< (US_IER) LON Collision Interrupt Enable Position */
#define US_IER_LON_LCOL_Msk                 (_U_(0x1) << US_IER_LON_LCOL_Pos)              /**< (US_IER) LON Collision Interrupt Enable Mask */
#define US_IER_LON_LCOL                     US_IER_LON_LCOL_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LON_LCOL_Msk instead */
#define US_IER_LON_LFET_Pos                 26                                             /**< (US_IER) LON Frame Early Termination Interrupt Enable Position */
#define US_IER_LON_LFET_Msk                 (_U_(0x1) << US_IER_LON_LFET_Pos)              /**< (US_IER) LON Frame Early Termination Interrupt Enable Mask */
#define US_IER_LON_LFET                     US_IER_LON_LFET_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LON_LFET_Msk instead */
#define US_IER_LON_LRXD_Pos                 27                                             /**< (US_IER) LON Reception Done Interrupt Enable Position */
#define US_IER_LON_LRXD_Msk                 (_U_(0x1) << US_IER_LON_LRXD_Pos)              /**< (US_IER) LON Reception Done Interrupt Enable Mask */
#define US_IER_LON_LRXD                     US_IER_LON_LRXD_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LON_LRXD_Msk instead */
#define US_IER_LON_LBLOVFE_Pos              28                                             /**< (US_IER) LON Backlog Overflow Error Interrupt Enable Position */
#define US_IER_LON_LBLOVFE_Msk              (_U_(0x1) << US_IER_LON_LBLOVFE_Pos)           /**< (US_IER) LON Backlog Overflow Error Interrupt Enable Mask */
#define US_IER_LON_LBLOVFE                  US_IER_LON_LBLOVFE_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LON_LBLOVFE_Msk instead */
#define US_IER_LON_MASK                     _U_(0x1F0000C0)                                /**< \deprecated (US_IER_LON) Register MASK  (Use US_IER_LON_Msk instead)  */
#define US_IER_LON_Msk                      _U_(0x1F0000C0)                                /**< (US_IER_LON) Register Mask  */

/* LON_SPI mode */
#define US_IER_LON_SPI_UNRE_Pos             10                                             /**< (US_IER) Underrun Error Interrupt Enable Position */
#define US_IER_LON_SPI_UNRE_Msk             (_U_(0x1) << US_IER_LON_SPI_UNRE_Pos)          /**< (US_IER) Underrun Error Interrupt Enable Mask */
#define US_IER_LON_SPI_UNRE                 US_IER_LON_SPI_UNRE_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IER_LON_SPI_UNRE_Msk instead */
#define US_IER_LON_SPI_MASK                 _U_(0x400)                                     /**< \deprecated (US_IER_LON_SPI) Register MASK  (Use US_IER_LON_SPI_Msk instead)  */
#define US_IER_LON_SPI_Msk                  _U_(0x400)                                     /**< (US_IER_LON_SPI) Register Mask  */


