Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/usart.h
/* LIN mode */
#define US_IMR_LIN_LINBK_Pos                13                                             /**< (US_IMR) LIN Break Sent or LIN Break Received Interrupt Mask Position */
#define US_IMR_LIN_LINBK_Msk                (_U_(0x1) << US_IMR_LIN_LINBK_Pos)             /**< (US_IMR) LIN Break Sent or LIN Break Received Interrupt Mask Mask */
#define US_IMR_LIN_LINBK                    US_IMR_LIN_LINBK_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LIN_LINBK_Msk instead */
#define US_IMR_LIN_LINID_Pos                14                                             /**< (US_IMR) LIN Identifier Sent or LIN Identifier Received Interrupt Mask Position */
#define US_IMR_LIN_LINID_Msk                (_U_(0x1) << US_IMR_LIN_LINID_Pos)             /**< (US_IMR) LIN Identifier Sent or LIN Identifier Received Interrupt Mask Mask */
#define US_IMR_LIN_LINID                    US_IMR_LIN_LINID_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LIN_LINID_Msk instead */
#define US_IMR_LIN_LINTC_Pos                15                                             /**< (US_IMR) LIN Transfer Completed Interrupt Mask Position */
#define US_IMR_LIN_LINTC_Msk                (_U_(0x1) << US_IMR_LIN_LINTC_Pos)             /**< (US_IMR) LIN Transfer Completed Interrupt Mask Mask */
#define US_IMR_LIN_LINTC                    US_IMR_LIN_LINTC_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LIN_LINTC_Msk instead */
#define US_IMR_LIN_LINBE_Pos                25                                             /**< (US_IMR) LIN Bus Error Interrupt Mask Position */
#define US_IMR_LIN_LINBE_Msk                (_U_(0x1) << US_IMR_LIN_LINBE_Pos)             /**< (US_IMR) LIN Bus Error Interrupt Mask Mask */
#define US_IMR_LIN_LINBE                    US_IMR_LIN_LINBE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LIN_LINBE_Msk instead */
#define US_IMR_LIN_LINISFE_Pos              26                                             /**< (US_IMR) LIN Inconsistent Synch Field Error Interrupt Mask Position */
#define US_IMR_LIN_LINISFE_Msk              (_U_(0x1) << US_IMR_LIN_LINISFE_Pos)           /**< (US_IMR) LIN Inconsistent Synch Field Error Interrupt Mask Mask */
#define US_IMR_LIN_LINISFE                  US_IMR_LIN_LINISFE_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LIN_LINISFE_Msk instead */
#define US_IMR_LIN_LINIPE_Pos               27                                             /**< (US_IMR) LIN Identifier Parity Interrupt Mask Position */
#define US_IMR_LIN_LINIPE_Msk               (_U_(0x1) << US_IMR_LIN_LINIPE_Pos)            /**< (US_IMR) LIN Identifier Parity Interrupt Mask Mask */
#define US_IMR_LIN_LINIPE                   US_IMR_LIN_LINIPE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LIN_LINIPE_Msk instead */
#define US_IMR_LIN_LINCE_Pos                28                                             /**< (US_IMR) LIN Checksum Error Interrupt Mask Position */
#define US_IMR_LIN_LINCE_Msk                (_U_(0x1) << US_IMR_LIN_LINCE_Pos)             /**< (US_IMR) LIN Checksum Error Interrupt Mask Mask */
#define US_IMR_LIN_LINCE                    US_IMR_LIN_LINCE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LIN_LINCE_Msk instead */
#define US_IMR_LIN_LINSNRE_Pos              29                                             /**< (US_IMR) LIN Slave Not Responding Error Interrupt Mask Position */
#define US_IMR_LIN_LINSNRE_Msk              (_U_(0x1) << US_IMR_LIN_LINSNRE_Pos)           /**< (US_IMR) LIN Slave Not Responding Error Interrupt Mask Mask */
#define US_IMR_LIN_LINSNRE                  US_IMR_LIN_LINSNRE_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LIN_LINSNRE_Msk instead */
#define US_IMR_LIN_LINSTE_Pos               30                                             /**< (US_IMR) LIN Synch Tolerance Error Interrupt Mask Position */
#define US_IMR_LIN_LINSTE_Msk               (_U_(0x1) << US_IMR_LIN_LINSTE_Pos)            /**< (US_IMR) LIN Synch Tolerance Error Interrupt Mask Mask */
#define US_IMR_LIN_LINSTE                   US_IMR_LIN_LINSTE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LIN_LINSTE_Msk instead */
#define US_IMR_LIN_LINHTE_Pos               31                                             /**< (US_IMR) LIN Header Timeout Error Interrupt Mask Position */
#define US_IMR_LIN_LINHTE_Msk               (_U_(0x1) << US_IMR_LIN_LINHTE_Pos)            /**< (US_IMR) LIN Header Timeout Error Interrupt Mask Mask */
#define US_IMR_LIN_LINHTE                   US_IMR_LIN_LINHTE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LIN_LINHTE_Msk instead */
#define US_IMR_LIN_MASK                     _U_(0xFE00E000)                                /**< \deprecated (US_IMR_LIN) Register MASK  (Use US_IMR_LIN_Msk instead)  */
#define US_IMR_LIN_Msk                      _U_(0xFE00E000)                                /**< (US_IMR_LIN) Register Mask  */

/* LON mode */
#define US_IMR_LON_LSFE_Pos                 6                                              /**< (US_IMR) LON Short Frame Error Interrupt Mask Position */
#define US_IMR_LON_LSFE_Msk                 (_U_(0x1) << US_IMR_LON_LSFE_Pos)              /**< (US_IMR) LON Short Frame Error Interrupt Mask Mask */
#define US_IMR_LON_LSFE                     US_IMR_LON_LSFE_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LON_LSFE_Msk instead */
#define US_IMR_LON_LCRCE_Pos                7                                              /**< (US_IMR) LON CRC Error Interrupt Mask Position */
#define US_IMR_LON_LCRCE_Msk                (_U_(0x1) << US_IMR_LON_LCRCE_Pos)             /**< (US_IMR) LON CRC Error Interrupt Mask Mask */
#define US_IMR_LON_LCRCE                    US_IMR_LON_LCRCE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LON_LCRCE_Msk instead */
#define US_IMR_LON_LTXD_Pos                 24                                             /**< (US_IMR) LON Transmission Done Interrupt Mask Position */
#define US_IMR_LON_LTXD_Msk                 (_U_(0x1) << US_IMR_LON_LTXD_Pos)              /**< (US_IMR) LON Transmission Done Interrupt Mask Mask */
#define US_IMR_LON_LTXD                     US_IMR_LON_LTXD_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LON_LTXD_Msk instead */
#define US_IMR_LON_LCOL_Pos                 25                                             /**< (US_IMR) LON Collision Interrupt Mask Position */
#define US_IMR_LON_LCOL_Msk                 (_U_(0x1) << US_IMR_LON_LCOL_Pos)              /**< (US_IMR) LON Collision Interrupt Mask Mask */
#define US_IMR_LON_LCOL                     US_IMR_LON_LCOL_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LON_LCOL_Msk instead */
#define US_IMR_LON_LFET_Pos                 26                                             /**< (US_IMR) LON Frame Early Termination Interrupt Mask Position */
#define US_IMR_LON_LFET_Msk                 (_U_(0x1) << US_IMR_LON_LFET_Pos)              /**< (US_IMR) LON Frame Early Termination Interrupt Mask Mask */
#define US_IMR_LON_LFET                     US_IMR_LON_LFET_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LON_LFET_Msk instead */
#define US_IMR_LON_LRXD_Pos                 27                                             /**< (US_IMR) LON Reception Done Interrupt Mask Position */
#define US_IMR_LON_LRXD_Msk                 (_U_(0x1) << US_IMR_LON_LRXD_Pos)              /**< (US_IMR) LON Reception Done Interrupt Mask Mask */
#define US_IMR_LON_LRXD                     US_IMR_LON_LRXD_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LON_LRXD_Msk instead */
#define US_IMR_LON_LBLOVFE_Pos              28                                             /**< (US_IMR) LON Backlog Overflow Error Interrupt Mask Position */
#define US_IMR_LON_LBLOVFE_Msk              (_U_(0x1) << US_IMR_LON_LBLOVFE_Pos)           /**< (US_IMR) LON Backlog Overflow Error Interrupt Mask Mask */
#define US_IMR_LON_LBLOVFE                  US_IMR_LON_LBLOVFE_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LON_LBLOVFE_Msk instead */
#define US_IMR_LON_MASK                     _U_(0x1F0000C0)                                /**< \deprecated (US_IMR_LON) Register MASK  (Use US_IMR_LON_Msk instead)  */
#define US_IMR_LON_Msk                      _U_(0x1F0000C0)                                /**< (US_IMR_LON) Register Mask  */

/* LON_SPI mode */
#define US_IMR_LON_SPI_UNRE_Pos             10                                             /**< (US_IMR) SPI Underrun Error Interrupt Mask Position */
#define US_IMR_LON_SPI_UNRE_Msk             (_U_(0x1) << US_IMR_LON_SPI_UNRE_Pos)          /**< (US_IMR) SPI Underrun Error Interrupt Mask Mask */
#define US_IMR_LON_SPI_UNRE                 US_IMR_LON_SPI_UNRE_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_IMR_LON_SPI_UNRE_Msk instead */
#define US_IMR_LON_SPI_MASK                 _U_(0x400)                                     /**< \deprecated (US_IMR_LON_SPI) Register MASK  (Use US_IMR_LON_SPI_Msk instead)  */
#define US_IMR_LON_SPI_Msk                  _U_(0x400)                                     /**< (US_IMR_LON_SPI) Register Mask  */


/* -------- US_CSR : (USART Offset: 0x14) (R/ 32) Channel Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t RXRDY:1;                   /**< bit:      0  Receiver Ready (cleared by reading US_RHR) */
    uint32_t TXRDY:1;                   /**< bit:      1  Transmitter Ready (cleared by writing US_THR) */
    uint32_t :3;                        /**< bit:   2..4  Reserved */
    uint32_t OVRE:1;                    /**< bit:      5  Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) */
    uint32_t :3;                        /**< bit:   6..8  Reserved */
    uint32_t TXEMPTY:1;                 /**< bit:      9  Transmitter Empty (cleared by writing US_THR) */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t RIIC:1;                    /**< bit:     16  Ring Indicator Input Change Flag (cleared on read) */
    uint32_t DSRIC:1;                   /**< bit:     17  Data Set Ready Input Change Flag (cleared on read) */
    uint32_t DCDIC:1;                   /**< bit:     18  Data Carrier Detect Input Change Flag (cleared on read) */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct { // USART mode
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXBRK:1;                   /**< bit:      2  Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) */
    uint32_t :7;                        /**< bit:   3..9  Reserved */
    uint32_t ITER:1;                    /**< bit:     10  Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) */
    uint32_t :2;                        /**< bit: 11..12  Reserved */
    uint32_t NACK:1;                    /**< bit:     13  Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) */
    uint32_t :5;                        /**< bit: 14..18  Reserved */
    uint32_t CTSIC:1;                   /**< bit:     19  Clear to Send Input Change Flag (cleared on read) */
    uint32_t RI:1;                      /**< bit:     20  Image of RI Input                        */
    uint32_t DSR:1;                     /**< bit:     21  Image of DSR Input                       */
    uint32_t DCD:1;                     /**< bit:     22  Image of DCD Input                       */
    uint32_t CTS:1;                     /**< bit:     23  Image of CTS Input                       */
    uint32_t MANERR:1;                  /**< bit:     24  Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } USART;                                /**< Structure used for USART mode access */
  struct { // USART_LIN mode
    uint32_t :6;                        /**< bit:   0..5  Reserved */
    uint32_t FRAME:1;                   /**< bit:      6  Framing Error (cleared by writing a one to bit US_CR.RSTSTA) */
    uint32_t PARE:1;                    /**< bit:      7  Parity Error (cleared by writing a one to bit US_CR.RSTSTA) */
    uint32_t TIMEOUT:1;                 /**< bit:      8  Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) */
    uint32_t :23;                       /**< bit:  9..31  Reserved */
  } USART_LIN;                                /**< Structure used for USART_LIN mode access */
  struct { // SPI mode
    uint32_t :19;                       /**< bit:  0..18  Reserved */
    uint32_t NSSE:1;                    /**< bit:     19  NSS Line (Driving CTS Pin) Rising or Falling Edge Event */
    uint32_t :3;                        /**< bit: 20..22  Reserved */
    uint32_t NSS:1;                     /**< bit:     23  Image of NSS Line                        */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } SPI;                                /**< Structure used for SPI mode access */
  struct { // LIN mode
    uint32_t :13;                       /**< bit:  0..12  Reserved */
    uint32_t LINBK:1;                   /**< bit:     13  LIN Break Sent or LIN Break Received     */
    uint32_t LINID:1;                   /**< bit:     14  LIN Identifier Sent or LIN Identifier Received */
    uint32_t LINTC:1;                   /**< bit:     15  LIN Transfer Completed                   */
    uint32_t :7;                        /**< bit: 16..22  Reserved */
    uint32_t LINBLS:1;                  /**< bit:     23  LIN Bus Line Status                      */
    uint32_t :1;                        /**< bit:     24  Reserved */
    uint32_t LINBE:1;                   /**< bit:     25  LIN Bus Error                            */
    uint32_t LINISFE:1;                 /**< bit:     26  LIN Inconsistent Synch Field Error       */
    uint32_t LINIPE:1;                  /**< bit:     27  LIN Identifier Parity Error              */
    uint32_t LINCE:1;                   /**< bit:     28  LIN Checksum Error                       */
    uint32_t LINSNRE:1;                 /**< bit:     29  LIN Slave Not Responding Error Interrupt Mask */
    uint32_t LINSTE:1;                  /**< bit:     30  LIN Synch Tolerance Error                */
    uint32_t LINHTE:1;                  /**< bit:     31  LIN Header Timeout Error                 */
  } LIN;                                /**< Structure used for LIN mode access */
  struct { // LON mode
    uint32_t :6;                        /**< bit:   0..5  Reserved */
    uint32_t LSFE:1;                    /**< bit:      6  LON Short Frame Error                    */
    uint32_t LCRCE:1;                   /**< bit:      7  LON CRC Error                            */
    uint32_t :16;                       /**< bit:  8..23  Reserved */
    uint32_t LTXD:1;                    /**< bit:     24  LON Transmission End Flag                */
    uint32_t LCOL:1;                    /**< bit:     25  LON Collision Detected Flag              */
    uint32_t LFET:1;                    /**< bit:     26  LON Frame Early Termination              */
    uint32_t LRXD:1;                    /**< bit:     27  LON Reception End Flag                   */
    uint32_t LBLOVFE:1;                 /**< bit:     28  LON Backlog Overflow Error               */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } LON;                                /**< Structure used for LON mode access */
  struct { // LON_SPI mode
    uint32_t :10;                       /**< bit:   0..9  Reserved */
    uint32_t UNRE:1;                    /**< bit:     10  SPI Underrun Error                       */
    uint32_t :21;                       /**< bit: 11..31  Reserved */
  } LON_SPI;                                /**< Structure used for LON_SPI mode access */
  uint32_t reg;                         /**< Type used for register access */
} US_CSR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_CSR_OFFSET                       (0x14)                                        /**<  (US_CSR) Channel Status Register  Offset */

